/* Hindi initialisation for the jQuery UI date picker plugin. */
/* Written by Michael Dawart. */
jQuery(function($){
	$.datepicker.regional['hi'] = {
		closeText: '±¨¸æ±¨¸æ¦',
		prevText: '±¨¸æ±¨¸æ±¨¸æà¤¾',
		nextText: '±¨¸æ±¨¸æ±¨¸æ',
		currentText: '±¨¸æ¤œ',
		monthNames: ['±¨¸æ±¨¸æ±¨¸æà¥€ ','±¨¸æ±¨¸æ±¨¸æà¥€','±¨¸æ±¨¸æ±¨¸æà¤š','±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤²','±¨¸æ¤ˆ','±¨¸æ±¨¸æ¨',
		'±¨¸æ±¨¸æ±¨¸æà¤ˆ','±¨¸æ±¨¸æ±¨¸æà¤¤ ','±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ°','±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ°','±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤°','±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ°'],
		monthNamesShort: ['±¨¸æ¤¨', '±¨¸æ¤°', '±¨¸æ±¨¸æ±¨¸æà¤š', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤²', '±¨¸æ¤ˆ', '±¨¸æ±¨¸æ¨',
		'±¨¸æ±¨¸æ±¨¸æà¤ˆ', '±¨¸æ¤—', '±¨¸æ±¨¸æ¤', '±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ¤µ', '±¨¸æ¤¿'],
		dayNames: ['±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤°', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤°', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ°', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤°', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ°', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ±¨¸æ±¨¸æ±¨¸æ¤°'],
		dayNamesShort: ['±¨¸æ±¨¸æ¿', '±¨¸æ±¨¸æ®', '±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ±¨¸æ§', '±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ±¨¸æ±¨¸æà¤°', '±¨¸æ±¨¸æ¿'],
		dayNamesMin: ['±¨¸æ±¨¸æ¿', '±¨¸æ±¨¸æ®', '±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ±¨¸æ§', '±¨¸æ±¨¸æ±¨¸æ', '±¨¸æ±¨¸æ±¨¸æà¤°', '±¨¸æ±¨¸æ¿'],
		weekHeader: '±¨¸æ±¨¸æ±¨¸æà¤¾',
		dateFormat: 'dd/mm/yy',
		firstDay: 1,
		isRTL: false,
		showMonthAfterYear: false,
		yearSuffix: ''};
	$.datepicker.setDefaults($.datepicker.regional['hi']);
});
