/* Tamil (UTF-8) initialisation for the jQuery UI date picker plugin. */
/* Written by S A Sureshkumar (saskumar@live.com). */
jQuery(function($){
	$.datepicker.regional['ta'] = {
		closeText: '±®∏Ê±®∏Ê±®∏Ê',
		prevText: '±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡ØÅ',
		nextText: '±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê',
		currentText: '±®∏Ê±®∏Ê±®∏Ê‡ØÅ',
		monthNames: ['±®∏ÊØà','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êø','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏ÊÆø','±®∏Ê±®∏Êø',
		'±®∏Ê±®∏Êø','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡Æø','±®∏Ê±®∏Ê±®∏Ê±®∏ÊÆø','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏ÊØà','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êø'],
		monthNamesShort: ['±®∏ÊØà','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Êç','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Êø',
		'±®∏Ê±®∏Êø','±®∏ÊÆµ','±®∏Ê±®∏Ê∞','±®∏Ê±®∏Êç','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê'],
		dayNames: ['±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êà','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êà','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏ÊØà','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡Øà','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏ÊØà'],
		dayNamesShort: ['±®∏Ê±®∏Ê±®∏Ê±®∏ÊØÅ','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê‡Øç','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç','±®∏Ê±®∏Ê±®∏Ê±®∏ÊÆø','±®∏Ê±®∏Êø'],
		dayNamesMin: ['±®∏ÊÆæ','±®∏ÊÆø','±®∏ÊØÜ','±®∏ÊØÅ','±®∏ÊÆø','±®∏ÊØÜ','‡Æö'],
		weekHeader: '±®∏Ê',
		dateFormat: 'dd/mm/yy',
		firstDay: 1,
		isRTL: false,
		showMonthAfterYear: false,
		yearSuffix: ''};
	$.datepicker.setDefaults($.datepicker.regional['ta']);
});
