/* Malayalam (UTF-8) initialisation for the jQuery UI date picker plugin. */
/* Written by Saji Nediyanchath (saji89@gmail.com). */
jQuery(function($){
	$.datepicker.regional['ml'] = {
		closeText: '±®∏Ê±®∏Êø',
		prevText: '±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡µÜ',  
		nextText: '±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê ',
		currentText: '±®∏Ê±®∏Ê±®∏Ê‡µç',
		monthNames: ['±®∏Ê±®∏Ê±®∏Ê±®∏Ê¥ø','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡¥ø','±®∏Ê±®∏Ê±®∏Ê‚Ä±®∏Ê±®∏Ê±®∏Êç','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç‚Äç','±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê‚Äç',
		'±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç‚Äç','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‚Äç','±®∏Ê±®∏Ê±®∏Ê±®∏Êµç‚Äç','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç‚Äç'],
		monthNamesShort: ['±®∏Ê±®∏ÊÅ', '±®∏Ê±®∏Ê±®∏Ê', '±®∏Ê±®∏Ê±®∏Ê‚Äç', '±®∏Ê±®∏Ê±®∏Ê‡¥ø', '±®∏Ê±®∏Ê±®∏Ê', '±®∏Ê±®∏Ê±®∏Ê‚Äç',
		'±®∏Ê±®∏Ê±®∏Ê', '±®∏Ê¥ó', '±®∏Ê±®∏Ê±®∏Ê', '±®∏Ê±®∏Ê±®∏Ê‡µã', '±®∏Ê±®∏ÊÇ', '±®∏Ê±®∏Ê∏'],
		dayNames: ['±®∏Ê±®∏Ê±®∏Ê±®∏ÊÄç', '±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êç‚Äç', '±®∏Ê±®∏Ê±®∏Ê‡¥µ', '±®∏Ê±®∏Ê±®∏Ê±®∏ÊÄç', '±®∏Ê±®∏Ê±®∏Ê±®∏Ê¥Ç', '±®∏Ê±®∏Ê±®∏Ê±®∏Ê¥ø', '±®∏Ê±®∏Êø'],
		dayNamesShort: ['±®∏Ê±®∏ÊØ', '±®∏Ê±®∏Ê±®∏Ê‡¥ï', '±®∏Ê±®∏Ê±®∏Ê‡¥µ', '±®∏Ê±®∏Êß', '±®∏Ê±®∏Ê±®∏Ê±®∏Ê¥Ç', '±®∏Ê±®∏Ê±®∏Ê±®∏Ê¥ø', '±®∏Ê±®∏Êø'],
		dayNamesMin: ['±®∏Ê¥æ','±®∏Ê¥ø','±®∏Êµä','±®∏ÊµÅ','±®∏Ê±®∏Ê±®∏Ê','±®∏ÊµÜ','‡¥∂'],
		weekHeader: '‡¥Ü',
		dateFormat: 'dd/mm/yy',
		firstDay: 1,
		isRTL: false,
		showMonthAfterYear: false,
		yearSuffix: ''};
	$.datepicker.setDefaults($.datepicker.regional['ml']);
});
