/* Thai initialisation for the jQuery UI date picker plugin. */
/* Written by pipo (pipo@sixhead.com). */
jQuery(function($){
	$.datepicker.regional['th'] = {
		closeText: '±®∏Ê±®∏Êî',
		prevText: '&#xAB;&#xA0;±®∏Ê±®∏Ê±®∏Ê',
		nextText: '±®∏Ê±®∏Ê±®∏Ê‡∏õ&#xA0;&#xBB;',
		currentText: '±®∏Ê±®∏Ê±®∏Ê±®∏Êπâ',
		monthNames: ['±®∏Ê±®∏Ê±®∏Ê±®∏Ê∏°','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êπå','±®∏Ê±®∏Ê±®∏Ê±®∏Ê∏°','‡πÄ±®∏Ê±®∏Ê±®∏Ê‡∏ô','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê°','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê',
		'±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê°','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê°','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êô','±®∏Ê±®∏Ê±®∏Ê±®∏Ê∏°','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê‡∏ô','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê°'],
		monthNamesShort: ['‡∏°.‡∏Ñ.','‡∏Å.‡∏û.','±®∏Ê∏µ.‡∏Ñ.','‡πÄ‡∏°.‡∏¢.','‡∏û.‡∏Ñ.','±®∏Ê∏¥.‡∏¢.',
		'‡∏Å.‡∏Ñ.','‡∏™.‡∏Ñ.','‡∏Å.‡∏¢.','‡∏ï.‡∏Ñ.','‡∏û.‡∏¢.','‡∏ò.‡∏Ñ.'],
		dayNames: ['±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Êå','±®∏Ê±®∏Ê±®∏Ê±®∏Êπå','±®∏Ê±®∏Ê±®∏Ê±®∏Ê∏£','±®∏Ê±®∏Êò','±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê±®∏Ê','±®∏Ê±®∏Ê±®∏Ê‡πå','‡πÄ±®∏Ê±®∏Ê±®∏Ê'],
		dayNamesShort: ['±®∏Ê∏≤.','‡∏à.','‡∏≠.','‡∏û.','±®∏Ê∏§.','‡∏®.','‡∏™.'],
		dayNamesMin: ['±®∏Ê∏≤.','‡∏à.','‡∏≠.','‡∏û.','±®∏Ê∏§.','‡∏®.','‡∏™.'],
		weekHeader: 'Wk',
		dateFormat: 'dd/mm/yy',
		firstDay: 0,
		isRTL: false,
		showMonthAfterYear: false,
		yearSuffix: ''};
	$.datepicker.setDefaults($.datepicker.regional['th']);
});